#### Workset Members

---

|  |
| --- |
| Workset Class   Methods   Properties   See Also |

The  Workset  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new workset. |
| Public method | Dispose | (Inherited from  WorksetPreview  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Id | Id of the workset. (Inherited from  WorksetPreview  .) |
| Public property | IsDefaultWorkset | Whether the workset is the default one. (Inherited from  WorksetPreview  .) |
| Public property | IsEditable | Whether the workset is editable. |
| Public property | IsOpen | Whether the workset is open (rather than closed). |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  WorksetPreview  .) |
| Public property | IsVisibleByDefault | Whether the workset is visible by default. |
| Public property | Kind | Kind of the workset. |
| Public property | Name | Name of the workset. (Inherited from  WorksetPreview  .) |
| Public property | Owner | User name of the workset. (Inherited from  WorksetPreview  .) |
| Public property | UniqueId | UniqueId of the workset. (Inherited from  WorksetPreview  .) |

# See Also

Workset Class

Autodesk.Revit.DB Namespace